//ДОМАШКА

// =================================================================
// Відео 3. Циклы FOR и WHILE в JavaScript. Директивы break и continue. Уроки JAVASCRIPT с нуля 2020
// =================================================================
"use strict";
//Задача №1
//Вывести в консоль числа от 1 до 5
// 
let numbers;
for (numbers = 1; numbers <= 5; numbers++) {
	console.log(numbers);
}
// ============================================
//Задача №3. Переписать на while
for (let num = 0; num < 3; num++) {
	console.log(`Число: ${num}`);
}
// while
let num = 0;
while (num < 3) {
	console.log(`Число: ${num}`);
	num++;
}
// ============================================
//Задача №4. Прекратить работу цикла №1 когда size равна 1
//Цикл №1
stopWorking: for (let num = 0; num < 2; num++) {
	// Цикл №2
	for (let size = 0; size < 3; size++) {
		if (size == 1) {
			break stopWorking;
		}
		console.log(size);
	}
}
// =================================================================
// Відео 4. Числа в JAVASCRIPT. Тип данных number. Работа с числами. проблема неточных вычислений.
// =================================================================
// Задача №1. Получить верное значение округления
// let numOne = Math.round(1.005 * 100) / 100;
// console.log(numOne); // Выведет 1 что не верно
// Рішення
let sourceNum = 1.005 + Number.EPSILON;
let numOne = Math.round(sourceNum * 100) / 100;
console.log(numOne);
//===========================================
// Задача №2. Получить число 135.58 из строки
// let value = "135.58px";
let value = parseFloat("135.58px");
console.log(value);
// ==========================================
// Задача №3. Посттроить верное условное ветвление
let valueThree = 58 + "Фрилансер";
if (isNaN(valueThree)) {
	console.log('Результат выражения NaN');
}
// ==========================================
// Задача №4.
// Найти максимальное число из 10,58,39,-150,0
console.log(Math.max(10, 58, 39, -150, 0));
// ==========================================
// Задача №5.
// Округлить число 58.858 до числа 58
let valueInt = Math.floor(58.858);
console.log(valueInt);
// =================================================================
// Відео 5. Строки в JAVASCRIPT. Тип данных string. Типы кавычек, поиск, регистр и получение подстроки.
// =================================================================
// Задача №2. Получить символ "н" строки:
let exmpl = 'фрилансер';
console.log(exmpl.indexOf('н'));
console.log(exmpl[5]);
// ==========================================
// Задача №4. Получить строку в верхнем регистре
let exmplTwo = 'фрилансер';
console.log(exmplTwo.toUpperCase());
// ==========================================
// Задача №5. Получить подстроку "лан" из:
let exmplThree = 'фрилансер';
console.log(exmplThree.slice(3, 6));
// Задача №6. true или false ?
let exmplFour = 'фрилансер';
console.log(exmplFour.includes('лан', 4));
